In [83]:
import pandas as pd
import numpy as np

Importing data sets and combining them into one csv file

In [84]:
df1 = pd.read_csv("Crop_recommendation.csv")
df1.head()


df2 =pd.read_csv("CropNFert.csv")
df2.head()
df1.head()

,Nitrogen,phosphorus,potassium,temperature,humidity,ph,rainfall,label
0,90,42,43,20.879744,82.002744,6.502985,202.935536,rice
1,85,58,41,21.770462,80.319644,7.038096,226.655537,rice
2,60,55,44,23.004459,82.320763,7.840207,263.964248,rice
3,74,35,40,26.491096,80.158363,6.980401,242.864034,rice
4,78,42,42,20.130175,81.604873,7.628473,262.717340,rice

Removing unnecessary columns and rows in the first data set

In [85]:
#Selecting the columns we are going to keep
columns_to_keep_df1 =['Nitrogen','phosphorus','potassium','temperature','ph','rainfall','label']
df1 = df1[columns_to_keep_df1]
df1.head()

# isin() function to select rows we will keep

options1 = ['rice', 'mothbeans', 'mungbean']
new_df1 = df1[df1['label'].isin(options1)]
new_df1.head()

   Nitrogen  phosphorus  potassium  temperature        ph    rainfall label
0        90          42         43    20.879744  6.502985  202.935536  rice
1        85          58         41    21.770462  7.038096  226.655537  rice
2        60          55         44    23.004459  7.840207  263.964248  rice
3        74          35         40    26.491096  6.980401  242.864034  rice
4        78          42         42    20.130175  7.628473  262.717340  rice

We do the same for the second dataset

In [86]:
#Selecting the columns we are going to keep
columns_to_keep_df2 =['Nitrogen','Phosphorus','Potassium','Temperature','pH','Rainfall','Crop']
df2 = df2[columns_to_keep_df2]

# isin() function to select rows we will keep

options2 = ['Rice', 'Groundnut', 'Maize']
new_df2 = df2[df2['Crop'].isin(options2)]
new_df2.head()

     Nitrogen  Phosphorus  Potassium  Temperature   pH  Rainfall  Crop
624        20          15         20           25  5.5       700  Rice
625        25          15         20           25  5.5       700  Rice
626        30          15         20           25  5.5       700  Rice
627        20          20         25           30  6.0       800  Rice
628        25          20         25           30  6.0       800  Rice

checking the index(s) for each dataset

In [87]:
print(new_df1.index)
print(new_df2.index)

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       690, 691, 692, 693, 694, 695, 696, 697, 698, 699],
      dtype='int64', length=300)
Index([ 624,  625,  626,  627,  628,  629,  630,  631,  632,  633,
       ...
       4204, 4205, 4206, 4207, 4208, 4209, 4210, 4211, 4212, 4213],
      dtype='int64', length=836)

In [88]:
df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
print(new_df1.index)
print(new_df2.index)

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       690, 691, 692, 693, 694, 695, 696, 697, 698, 699],
      dtype='int64', length=300)
Index([ 624,  625,  626,  627,  628,  629,  630,  631,  632,  633,
       ...
       4204, 4205, 4206, 4207, 4208, 4209, 4210, 4211, 4212, 4213],
      dtype='int64', length=836)

Then we concatinate the two new data frames into on data frame

In [94]:
concatenated_df = pd.concat([new_df1, new_df2], axis=0)
#concatenated_df.reset_index(drop=True, inplace=True)

columns_to_drop = ['Nitrogen','Phosphorus','Potassium','Temperature','pH','Rainfall','Crop']
concatenated_df = concatenated_df.drop(columns=columns_to_drop)
duplicate_rows = concatenated_df[concatenated_df.duplicated()]

if duplicate_rows.empty:
    print("No duplicate rows found.")
else:
    print("Duplicate rows found:")
    print(duplicate_rows)

concatenated_df.head()
duplicated_rows.head()

Duplicate rows found:
      phosphorus  potassium  temperature  ph  rainfall label
625          NaN        NaN          NaN NaN       NaN   NaN
626          NaN        NaN          NaN NaN       NaN   NaN
627          NaN        NaN          NaN NaN       NaN   NaN
628          NaN        NaN          NaN NaN       NaN   NaN
629          NaN        NaN          NaN NaN       NaN   NaN
...          ...        ...          ...  ..       ...   ...
4209         NaN        NaN          NaN NaN       NaN   NaN
4210         NaN        NaN          NaN NaN       NaN   NaN
4211         NaN        NaN          NaN NaN       NaN   NaN
4212         NaN        NaN          NaN NaN       NaN   NaN
4213         NaN        NaN          NaN NaN       NaN   NaN

[835 rows x 6 columns]

NameError: name 'duplicated_rows' is not defined

Checking if any of the data is missing ie Null values

In [90]:
print(concatenated_df.isnull().sum())
concatenated_df.info()

phosphorus     836
potassium      836
temperature    836
ph             836
rainfall       836
label          836
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1136 entries, 0 to 1135
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   phosphorus   300 non-null    float64
 1   potassium    300 non-null    float64
 2   temperature  300 non-null    float64
 3   ph           300 non-null    float64
 4   rainfall     300 non-null    float64
 5   label        300 non-null    object
dtypes: float64(5), object(1)
memory usage: 53.4+ KB